app/views/pages/profile.html.erb

SELECT "posts".* FROM "posts" WHERE (user_id = 2) ORDER BY "posts"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        	<div class="col-sm-11">
        	<p class="post-title"><span class="post-owner"><%= User.find(@p.user_id).username %></span> <span class="post-creation"> - <%= @p.created_at.to_formatted_s(:short) %></span></p>

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "sud183"], ["LIMIT", 1]]
---
	<div class="col-md-3">
	<%= render '/components/follow_button', :user => User.find_by_username(params[:id]) %>