app/controllers/pages_controller.rb

  def profile
  	# grab the username from URL as :id
  	if (User.find_by_username(params[:id]))
  	@username = params[:id]
  else
  	redirect_to root_path, :notice=> "User not found!"
  end

   @posts = Post.all.where("user_id = ?", User.find_by_username(params[:id]).id)
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "sud183"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id = 2) ORDER BY "posts"."created_at" DESC