app/views/layouts/application.html.erb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "sud183"], ["LIMIT", 1]]
---
            <div class="col-sm-2" style="font-size: 100%; opacity: 0.7;">POSTS<br>
                    <h6 style="color: #0084B4; font-size: 150%;"><%= User.find_by_username(params[:id]).posts.count %></h6></div>
            <div class="col-sm-2" style="font-size: 100%; opacity: 0.7;">FOLLOWERS<br>
                    <h6 style="color: #0084B4; font-size: 150%;"><%= User.find_by_username(params[:id]).followers.count %></h6></div>